#Область ПрограммныйИнтерфейс

// Инициализация.
// 
// Параметры:
//  Этот - Структура
Процедура Инициализация(Этот) Экспорт
			
	Этот.Вставить("Имя", "");
	Этот.Вставить("ЗначениеПоУмолчанию");
	Этот.Вставить("МодификаторДоступа", ОП_Перечисления.МодификаторыДоступа().Служебно);
	Этот.Вставить(
		"Экспорт",
		Обработки.ОП_МетодОбъекта.Метод("УстановитьЭкспорт", ОП_Переменная, Этот)
	);
	Этот.Вставить(
		"Служебно",
		Обработки.ОП_МетодОбъекта.Метод("УстановитьСлужебно", ОП_Переменная, Этот)
	);
	
КонецПроцедуры

// Делает переменную экспортной
// 
// Параметры:
//  Этот - Структура
Процедура УстановитьЭкспорт(Этот) Экспорт
	
	Этот.МодификаторДоступа = ОП_Перечисления.МодификаторыДоступа().Экспорт;
	
КонецПроцедуры

// Делает переменную служебной
// 
// Параметры:
//  Этот - Структура
Процедура УстановитьСлужебно(Этот) Экспорт
	
	Этот.МодификаторДоступа = ОП_Перечисления.МодификаторыДоступа().Служебно;
	
КонецПроцедуры

#КонецОбласти
