Процедура Инициализация(Этот) Экспорт

	Этот.Перем._("Статус", "Не установлен").Экспорт._();

	Этот.Метод._("Привет");
	Этот.Метод._("ДатаСтрокой");
	Этот.Метод._("Документ");
	
КонецПроцедуры

Процедура ПриСозданииОбъекта(Этот) Экспорт
	Этот.Статус = "Создан";
КонецПроцедуры

Функция Привет(Этот) Экспорт
	Возврат "Привет";
КонецФункции

Функция ДатаСтрокой(Этот, Дата) Экспорт
	Возврат Формат(Дата, "ДФ=dd.MM.yyyy;");
КонецФункции

Функция Документ(Этот, Сотрудник) Экспорт
	
	Этот.Статус = "Создан документ";
	Возврат ОП_Классы.Класс(Тест_Документ).Новый._(Сотрудник);
	
КонецФункции