Процедура Инициализация(Этот) Экспорт

	Этот.Перем._("Сотрудник").Экспорт._();
	Этот.Перем._("Дата", Дата(1, 1, 1)).Экспорт._();
	Этот.Перем._("Подписан", Ложь).Экспорт._();
	Этот.Перем._("Статус", "").Экспорт._();

	Этот.Метод._("Записать");
	Этот.Метод._("Выгрузить");

КонецПроцедуры

Процедура ПриСозданииОбъекта(Этот, Сотрудник) Экспорт
	Этот.Сотрудник = Сотрудник;
КонецПроцедуры

Процедура Записать(Этот) Экспорт
	Этот.Статус = "Записан";
КонецПроцедуры

Процедура Выгрузить(Этот) Экспорт
	Этот.Статус = "Выгружен";
КонецПроцедуры