Процедура ИсполняемыеСценарии() Экспорт
	
	ЮТТесты
		.ДобавитьТест("Тест_ПроверяетСуществованиеПроцедурыОбъектаСтандартнойБиблиотеки")
		.ДобавитьТест("Тест_ПроверяетОтсутствиеМетодаОбъектаСтандартнойБиблиотеки")
		.ДобавитьТест("Тест_ПроверяетСуществованиеФункцииОбъектаСтандартнойБиблиотеки")
		.ДобавитьТест("Тест_ПроверяетСуществованиеПроцедурыОбъекта")
		.ДобавитьТест("Тест_ПроверяетЧтоМетодОбъектаНеСуществует")
		.ДобавитьТест("Тест_ПроверяетСуществованиеФункцииОбъекта")
		.ДобавитьТест("Тест_ПроверяетЧтоПроцедураОбъектаЯвляетсяТаковой")
		.ДобавитьТест("Тест_ПроверяетЧтоФункцияОбъектаЭтоНеПроцедура");
	
КонецПроцедуры

Процедура Тест_ПроверяетСуществованиеПроцедурыОбъектаСтандартнойБиблиотеки() Экспорт

	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(Новый Массив(), "Добавить")
	).ЭтоИстина();

КонецПроцедуры

Процедура Тест_ПроверяетОтсутствиеМетодаОбъектаСтандартнойБиблиотеки() Экспорт

	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(Новый Массив(), "Добавить_")
	).ЭтоЛожь();

КонецПроцедуры

Процедура Тест_ПроверяетСуществованиеФункцииОбъектаСтандартнойБиблиотеки() Экспорт

	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(Новый Массив(), "Найти")
	).ЭтоИстина();

КонецПроцедуры

Процедура Тест_ПроверяетСуществованиеПроцедурыОбъекта() Экспорт
	
	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(
			Обработки.Тест_Обработка.Создать(),
			"ЭтоПроцедура"
		)
	).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_ПроверяетЧтоМетодОбъектаНеСуществует() Экспорт

	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(
			Обработки.Тест_Обработка.Создать(),
			"Создать"
		)
	).ЭтоЛожь();
	
КонецПроцедуры

Процедура Тест_ПроверяетСуществованиеФункцииОбъекта() Экспорт
	
	ЮТУтверждения.Что(
		ОП_Рефлексия.МетодОбъектаСуществует(
			Обработки.Тест_Обработка.Создать(),
			"ЭтоФункция"
		)
	).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_ПроверяетЧтоПроцедураОбъектаЯвляетсяТаковой() Экспорт
	
	ЮТУтверждения.Что(
		ОП_Рефлексия.ЭтоПроцедураОбъекта(
			Обработки.Тест_Обработка.Создать(),
			"ЭтоПроцедура"
		)
	).ЭтоИстина();
	
КонецПроцедуры

Процедура Тест_ПроверяетЧтоФункцияОбъектаЭтоНеПроцедура() Экспорт
	
	ЮТУтверждения.Что(
		ОП_Рефлексия.ЭтоПроцедураОбъекта(
			Обработки.Тест_Обработка.Создать(),
			"ЭтоФункция"
		)
	).ЭтоЛожь();
	
КонецПроцедуры