// @strict-types


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Присваиватель.
// 
// Параметры:
//  Объект - Структура
//  Имя - Строка
//  Значение - Произвольный
// 
// Возвращаемое значение:
//  ОбработкаОбъект.ОП_Присваиватель - Присваиватель
Функция Присваиватель(Объект, Имя, Значение) Экспорт
	
	Присваиватель = Создать();
	Присваиватель.УстановитьОбъект(Объект);
	Присваиватель.УстановитьПоле(Имя);
	Присваиватель.УстановитьЗначениеПоУмолчанию(Значение);
	Возврат Присваиватель;
	
КонецФункции
	
#КонецОбласти

#КонецЕсли
