// @strict-types


#Область ПрограммныйИнтерфейс

// Базовый.
// 
// Параметры:
//  Класс - см. ОП_Классы.Класс
// 
// Возвращаемое значение:
//  Структура - Базовый:
// * Класс - см. ОП_Классы.Класс
Функция Базовый(Класс) Экспорт

	Базовый = Новый Структура();
	Базовый.Вставить("Класс", Новый ФиксированнаяСтруктура(Класс));
	Возврат Базовый;
	
КонецФункции
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
